[
  { 
    "title": "AI Chess Coaches?",
    "date": "2026-01-06",
    "description": "Can modern AI actually teach chess, not just analyse it? In this article, I explore where today’s tools genuinely help, where they fall short, and what a realistic AI chess coach might look like when engines, data, and language models are used as assistants rather than oracles.",
    "url": "https://lichess.org/@/HollowLeaf/blog/ai-chess-coaches/iE4R5tPl"
  },
  { 
    "title": "Repertoire Builder 1.4 Released",
    "date": "2026-01-02",
    "description": "Introduces Gap Analysis to uncover missing moves in your openings, adds Leela Chess Zero for neural-network analysis and practice, enables MCP-based AI workflows, expands Playbooks with new Grandmasters and matching bots, and boosts training with Standard and Repertoire Puzzles.",
    "goto": "repertoirebuilder"
  },
  {
    "title": "Opening Inaccuracies Tool Released",
    "date": "2025-12-21",
    "description": "A new analysis tool that imports your games and surfaces recurring opening inaccuracies, helping you spot familiar habits and patterns that quietly hold back improvement.",
    "goto": "openinginaccuracies",
    "url": "https://www.patreon.com/posts/opening-tool-146342022"
  },
  {
    "title": "Using Maia to Find Repertoire Gaps",
    "date": "2025-12-12",
    "description": "An exploration of how Maia exposes hidden gaps in your opening repertoire by comparing your moves against realistic, human-like expectations rather than engine-driven calculations.",
    "url": "https://lichess.org/@/HollowLeaf/blog/using-maia-and-leela-chess-zero-to-find-repertoire-gaps/VC2JsrqO"
  },
  {
    "title": "Integrating Maia2 into My Chess Application",
    "date": "2025-12-07",
    "description": "A behind-the-scenes technical overview of what Maia2 is, why it matters for chess improvement, and how it was integrated into my application for more human-focused analysis.",
    "url": "https://www.patreon.com/posts/integrating-like-145281462"
  }
]
